emoticons = "(> ͜ʖ<)( ͡°((> ͜ʖ<)(> ͜ʖ<)(> ͜ʖ<)(> ͜ʖ<)(> ͜ʖ<)(> ͜ʖ<)(> ͜ʖ<)ᕦ( ͡°ヮ ͡°)ᕥ( ͡° ͜ʖ ͡°)(∩ ͡° ͜ʖ ͡°)⊃━☆ﾟ(♥ ͜ʖ♥)*) ͡°)ᕦ( ͡°ヮ ͡°)ᕥ(> ͜ʖ<)(♥ ͜ʖ♥)( ͡°((> ͜ʖ<)(> ͜ʖ<)(> ͜ʖ<)ᕦ( ͡°ヮ ͡°)ᕥ( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)(∩ ͡° ͜ʖ ͡°)⊃━☆ﾟ(♥ ͜ʖ♥)* ) ͡°)ᕦ( ͡°ヮ ͡°)ᕥ( ͡° ͜ʖ ͡°)(♥ ͜ʖ♥)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)(♥ ͜ʖ♥)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)(♥ ͜ʖ♥)ᕦ( ͡°ヮ ͡°)ᕥ(> ͜ʖ<)( ͡°((> ͜ʖ<)(> ͜ʖ<)(> ͜ʖ<)ᕦ( ͡°ヮ ͡°)ᕥ( ͡° ͜ʖ ͡°)(∩ ͡° ͜ʖ ͡°)⊃━☆ﾟ(♥ ͜ʖ♥)* ) ͡°)ᕦ( ͡°ヮ ͡°)ᕥ(> ͜ʖ<)(♥ ͜ʖ♥)(> ͜ʖ<)( ͡°((> ͜ʖ<)(> ͜ʖ<)(> ͜ʖ<)ᕦ( ͡°ヮ ͡°)ᕥ( ͡° ͜ʖ ͡°)(∩ ͡° ͜ʖ ͡°)⊃━☆ﾟ(♥ ͜ʖ♥)* ) ͡°)ᕦ( ͡°ヮ ͡°)ᕥ( ͡° ͜ʖ ͡°)(♥ ͜ʖ♥)(> ͜ʖ<)(> ͜ʖ<)(> ͜ʖ<)(> ͜ʖ<)(> ͜ʖ<)(> ͜ʖ<)(> ͜ʖ<)(> ͜ʖ<)(> ͜ʖ<)(♥ ͜ʖ♥)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)(♥ ͜ʖ♥)(> ͜ʖ<)(> ͜ʖ<)(> ͜ʖ<)(> ͜ʖ<)(> ͜ʖ<)(♥ ͜ʖ♥)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)(♥ ͜ʖ♥)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)(♥ ͜ʖ♥)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)"

print(
    emoticons
        .replace(") ͡°)", "]")
        .replace("( ͡°(", "[")
        .replace("ᕦ( ͡° ͜ʖ ͡°)ᕥ", "^")
        .replace("ᕦ( ͡°ヮ ͡°)ᕥ", ">")
        .replace("ᕙ( ͡° ͜ʖ ͡°)ᕗ", ",")
        .replace("(♥ ͜ʖ♥)", ".")
        .replace("(> ͜ʖ<)", "-")
        .replace('(∩ ͡° ͜ʖ ͡°)⊃━☆ﾟ.*', "<")
        .replace("( ͡° ͜ʖ ͡°)", "+")
)
